{
    "home":"Home",
    "project_description":"The creation of this very website was both a conceptual and technical challenge to achieve a balance between aesthetics, performance, and usability. <br><br>This project started with the idea of having a space to showcase my skills through an interactive experience, in a professional format.",
    "method":"Methodology",
    "method_text":"During the development process, I followed the principles of <b>Lean UX</b>, prioritizing agility in design cycles with a user-centered approach and continuous feedback from colleagues and professionals across different fields.<br><br>Applying this methodology — combining paper sketches, rapid prototyping, and iterative adjustments — allowed me to stay flexible, improve along the way, and build a clear, consistent, and intuitive interface.",
    "tech":"Tools and Technologies",
    "tech_text":"Besides the trusty pencil and paper, I used the following tools to design and build this site:",
    "challenges":"Design Challenges",
    "visual_xp":"💠 Designing a visually engaging and narrative-driven experience",
    "visual_xp_text":"My goal was to support the information presented on the site through an experience that feels like a moment along the way — something the visitor encounters “in passing.” This needed to be conveyed through visual elements that suggest that idea.",
    "visual_xp_solution":"The site is built around an illustration that simulates a roadside advertisement, accompanied by clouds, birds, and other elements that reinforce this atmosphere, creating a scene that evokes the feeling of traveling through an open landscape. The remaining sections preserve the color scheme and graphic elements, subtly maintaining continuity in the visual narrative.",
    "simple_func": "💠 Strike a balance between simplicity, functionality, and added value.",
    "simple_func_text":"I wanted to avoid overloading the site with unnecessary information or elements, without falling into an empty or soulless aesthetic. The challenge was to find the balance between visual simplicity and the ability to convey professionalism, warmth, and an enjoyable experience for the visitor.",
    "simple_func_solution":"I streamlined the site’s structure to only the essential sections and employed large, clear typography to emphasize key content. This strategy enabled me to craft a harmonious, focused visual experience—clean and distraction-free, yet rich in personality.",
    "responsive":"Responsive design: adapting the experience to any device.",
    "responsive_text":"The site needs to be responsive, providing a consistent experience across desktop computers and smartphones alike.",
    "responsive_solution":"The layout adapts dynamically to the available space. I simplified certain details in the mobile version without compromising the design’s identity, ensuring a seamless and consistent experience across all devices.",
    "conclusion":"This project represents not only my portfolio but also my design philosophy: simplicity, functionality, and purposeful intent. Every decision—whether visual or technical—was part of an exploratory process that helped me refine my style and experiment with subtle ways of storytelling through the interface."

}